#include <locale.h>
#include <stdio.h>

int n1();
int n2();
int n3();

int main()
{
	setlocale(LC_CTYPE, "RUS");
	n1();
	n2();
	n3();

	return 0;
}

int n1()
{
	printf("1\n2\n3\n");  // p1

	printf("1\n \t2\n \t \t3\n"); // p2

	printf("%4d\n", 1, 2, 3, 4); //p3

	printf("%10.5f\n ", 12.234657); //p5

	printf("Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5); //p7 - 9
	printf("Умножение %d на %d равно %d\n ", 2000, 4, 4 * 2000); //p7 - 9

	// p10
	printf("%d разделить на %d равно %d\n ", 5., 2000000., 5. / 2000000); //  0 разделить на 0 равно -1998362383
	printf("%f разделить на %f равно %f\n ", 5., 2000000., 5. / 2000000); // 5.000000 разделить на 2000000.000000 равно 0.000003
	printf("%g разделить на %g равно %g\n ", 5., 2000000., 5. / 2000000); //  5 разделить на 2e+06 равно 2.5e-06
	printf("%e разделить на %e равно %e\n ", 5., 2000000., 5. / 2000000); // 000000e+00 разделить на 2.000000e+06 равно 2.500000e-06
	
	return 0;
}

int n2()
{
	int N,K,S;
	N = 10;
	K = 33;
	S = 21;
	printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
	printf(" Идет %d минута суток\n", N*60 + K);
	printf(" До полуночи осталось %d часов и %d минут\n", 24-N, 60-K);
	printf(" С 8.00 прошло %d секунд\n", S);

	//printf(" Текущий час  = %d суток  и текущая минута =  %d часа\n", N/24, K/60);
	printf(" Текущий час =%2.2f суток и текущая минута =%2.2f часа\n", N/24., K/60.);

	return 0;
}

int n3()
{
	int n, L, k,m;
	n = 4;
	L = 337;
	k = n / L;
	m = n / L % 10;

	printf("Дано:\n   %d\n %d\n----\nОтвет:\n%d0000.%d11\n ", n, L, k, m);
	//00000.011

	return 0;
}
